Repository: Codepoints/unidump
Catalog: unidump/locale/*/LC_MESSAGES/unidump.po
Languages: de

source: A Unicode code point dump.
de: Ein Unicode-Codepunkt-Dump.

source: Think of it as hexdump(1) for Unicode. The command analyses the input and then prints three columns: the raw byte index of the first code point in this row, code points in their hex notation, and finally the raw input characters with control and whitespace replaced by a dot.
de: Denke es dir als hexdump(1) für Unicode. Der Befehl analysiert die Eingabe und gibt dann drei Spalten aus: die direkte Byte-Position des ersten Codepunkts in dieser Zeile, Codepunkte in ihrer Hex-Schreibweise und schließlich die rohen Eingabezeichen, wobei Kontrollzeichen und Leerzeichen durch einen Punkt ersetzt wurden.

source: Invalid byte sequences are represented with an “X” and with the hex value enclosed in question marks, e.g., “?F5?”.
de: Ungültige Byte-Sequenzen werden mit einem „X“ dargestellt und mit dem Hex-Wert in Fragezeichen eingeschlossen, z. B., „?F5?“.

source: You can pipe in data from stdin, select several files at once, or even mix all those input methods together.
de: Du kannst Daten von stdin einleiten, mehrere Dateien auf einmal auswählen oder sogar alle diese Eingabemethoden durcheinander verwenden.

source: Examples:
de: Beispiele:

source: * Basic usage with stdin:
de: * Normale Nutzung mit stdin:

source: * Dump the code points translated from another encoding:
de: * Gib die Codepunkte übersetzt aus einem anderen Encoding aus:

source: * Dump many files at the same time:
de: * Gib viele Dateien gleichzeitig aus:

source: * Control characters and whitespace are safely rendered:
de: * Kontrollzeichen und Leerzeichen werden sicher dargestellt:

source: * Finally learn what your favorite Emoji is composed of:
de: * Erfahre endlich, aus was dein Lieblings-Emoji zusammengesetzt ist:

source: See <http://emojipedia.org/man-elf-medium-skin-tone/> for images. The “elf” emoji (the first character) is replaced with a dot here, because the current version of Python’s unicodedata doesn’t know of this character yet.
de: Siehe <http://emojipedia.org/man-elf-medium-skin-tone/> für Bilder. Das „Elfen“-Emoji (das erste Zeichen) ist hier durch einen Punkt ersetzt, weil die aktuelle Version von Pythons unicodedata dieses Zeichen noch nicht kennt.

source: * Use it like strings(1):
de: * Verwende es wie strings(1):

source: This will replace every unknown byte from the input file with “X” and every control and whitespace character with “.”.
de: Das ersetzt jedes unbekannte Byte aus der Eingabedatei mit „X“ und jedes Kontroll- und Leerzeichen mit „.“.

source: * Only print the code points of the input:
de: * Gib nur die Codepunkte der Eingabe aus:

source: This results in a stream of code points in hex notation, each on a new line, without byte counter or rendering of actual data. You can use this to count the total amount of characters (as opposed to raw bytes) in a file, if you pipe it through `wc -l`.
de: Das Ergebnis ist eine Folge von Codepunkten in Hex-Notation, jeder auf einer eigenen Zeile, ohne Byte-Zähler oder Darstellung der tatsächlichen Daten. Du kannst das verwenden, um die Gesamtzahl an Zeichen (nicht rohe Bytes) in einer Datei zu bestimmen, indem du es durch `wc -l` pipest.

source: This is version {} of unidump, using Unicode {} data.
de: Das ist version {} von unidump mit Unicode-{}-Daten.

source: input files. Use “-” or keep empty for stdin.
de: Eingabe-Dateien. Verwende „-“ oder lasse es leer für stdin.

source: format output using this much input characters. Default is %(default)s characters.
de: formatiere die Ausgabe mit so vielen Eingabe-Zeichen. Vorgabe ist %(default)s Zeichen.

source: interpret input in this encoding. Default is %(default)s. You can choose any encoding that Python supports, e.g. “latin-1”.
de: interpretiere Eingabe in dieser Kodierung. Vorgabe ist %(default)s. Du kannst jede Kodierung wählen, die Python unterstützt, z. B. „latin-1“.

source: specify a custom format in Python’s {} notation. Default is “%s”. See examples below on how to use this option.
de: gib ein eigenes Format in Pythons {}-Schreibweise an. Vorgabe ist „%s“. Siehe Beispiele weiter unten wie diese Option verwendet wird.

source: %(prog)s {} using Unicode {} data
de: %(prog)s {} mit Unicode-{}-Daten

source: File {} not found.
de: Datei {} nicht gefunden.

source: {} is a directory.
de: {} ist ein Verzeichnis.
